In [2]:
# ===============================================================
# Lab 4: Working with Pandas and the Automobile Dataset
# ===============================================================
import pandas as pd
import numpy as np

# ---------------------------------------------------------------
# Part 1: Working with Series
# ---------------------------------------------------------------

print("\n================ Part 1: Working with Series ================\n")

# 1. Create and display a one-dimensional Series with sample data
data = pd.Series(['Toyota', 'Honda', 'BMW', 'Audi', 'Ford'])
print("1. One-dimensional Series with string data:\n", data)

# 2. Create two Pandas Series and perform arithmetic operations
series1 = pd.Series([2, 4, 6, 8, 10])
series2 = pd.Series([1, 3, 5, 7, 9])

print("\n2. Arithmetic operations on Series:")
print("Addition:\n", series1 + series2)
print("Subtraction:\n", series1 - series2)
print("Multiplication:\n", series1 * series2)
print("Division:\n", series1 / series2)

================ Part 1: Working with Series ================

1. One-dimensional Series with string data:
 0    Toyota
1     Honda
2       BMW
3      Audi
4      Ford
dtype: object

2. Arithmetic operations on Series:
Addition:
 0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtraction:
 0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiplication:
 0     2
1    12
2    30
3    56
4    90
dtype: int64
Division:
 0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [9]:
# ---------------------------------------------------------------
# Part 2: Working with the Automobile Dataset
# ---------------------------------------------------------------

print("\n================ Part 2: Working with Automobile Dataset ================\n")

# 3. Load the dataset 'Lab 4 - Automobile.xls'
file_path = "/Users/ankitarathod/Downloads/Lab 4 - Automobile.xls"
df = pd.read_excel(file_path)

print("3. Dataset loaded successfully!")

# 4. Print first five and last five rows
print("\n4. First 5 rows:\n", df.head())
print("\nLast 5 rows:\n", df.tail())

================ Part 2: Working with Automobile Dataset ================

3. Dataset loaded successfully!

4. First 5 rows:
    index      company   body-style  wheel-base  length engine-type  \
0      0  alfa-romero  convertible        88.6   168.8        dohc
1      1  alfa-romero  convertible        88.6   168.8        dohc
2      2  alfa-romero    hatchback        94.5   171.2        ohcv
3      3         audi        sedan        99.8   176.6         ohc
4      4         audi        sedan        99.4   176.6         ohc

  num-of-cylinders  horsepower  average-mileage    price
0             four         111               21  13495.0
1             four         111               21  16500.0
2              six         154               19  16500.0
3             four         102               24  13950.0
4             five         115               18  17450.0

Last 5 rows:
     index     company body-style  wheel-base  length engine-type  \
56     81  volkswagen      sedan        97.3   171.7         ohc
57     82  volkswagen      sedan        97.3   171.7         ohc
58     86  volkswagen      sedan        97.3   171.7         ohc
59     87       volvo      sedan       104.3   188.8         ohc
60     88       volvo      wagon       104.3   188.8         ohc

   num-of-cylinders  horsepower  average-mileage    price
56             four          85               27   7975.0
57             four          52               37   7995.0
58             four         100               26   9995.0
59             four         114               23  12940.0
60             four         114               23  13415.0

In [10]:
# 5. Remove records containing '?', 'n.a', or NaN
df.replace(['?', 'n.a'], np.nan, inplace=True)
clean_df = df.dropna()
clean_df.to_csv("Cleaned_Automobile_Data.csv", index=False)
print("\n5. Cleaned dataset saved as 'Cleaned_Automobile_Data.csv'.")

5. Cleaned dataset saved as 'Cleaned_Automobile_Data.csv'.

In [11]:
# 6. Find and print the most expensive car
if 'price' in clean_df.columns:
    most_expensive = clean_df.loc[clean_df['price'].astype(float).idxmax()]
    print("\n6. Most expensive car:")
    print("Company:", most_expensive['company'])
    print("Price:", most_expensive['price'])
else:
    print("\nColumn 'price' not found in dataset!")

# 7. Print all details of cars manufactured by Toyota
if 'company' in clean_df.columns:
    toyota_cars = clean_df[clean_df['company'].str.lower() == 'toyota']
    print("\n7. Cars manufactured by Toyota:\n", toyota_cars)
else:
    print("\nColumn 'company' not found in dataset!")

# 8. Count total number of cars per company
if 'company' in clean_df.columns:
    car_count = clean_df['company'].value_counts()
    print("\n8. Total number of cars per company:\n", car_count)
else:
    print("\nColumn 'company' not found in dataset!")

# 9. Display most expensive car from each company
if 'price' in clean_df.columns:
    most_expensive_per_company = clean_df.groupby('company')['price'].max()
    print("\n9. Most expensive car from each company:\n", most_expensive_per_company)
else:
    print("\nColumn 'price' not found in dataset!")

# 10. Calculate average mileage (fuel efficiency) for each company
if 'average-mileage' in clean_df.columns:
    avg_mileage = clean_df.groupby('company')['average-mileage'].mean()
    print("\n10. Average mileage for each company:\n", avg_mileage)
else:
    print("\nColumn 'average-mileage' not found in dataset!")

# 11. Sort all cars by price in ascending order
if 'price' in clean_df.columns:
    sorted_cars = clean_df.sort_values(by='price', ascending=True)
    print("\n11. Cars sorted by ascending price:\n", sorted_cars[['company', 'price']])
else:
    print("\nColumn 'price' not found in dataset!")

6. Most expensive car:
Company: mercedes-benz
Price: 45400.0

7. Cars manufactured by Toyota:
     index company body-style  wheel-base  length engine-type num-of-cylinders  \
48     66  toyota  hatchback        95.7   158.7         ohc             four
49     67  toyota  hatchback        95.7   158.7         ohc             four
50     68  toyota  hatchback        95.7   158.7         ohc             four
51     69  toyota      wagon        95.7   169.7         ohc             four
52     70  toyota      wagon        95.7   169.7         ohc             four
53     71  toyota      wagon        95.7   169.7         ohc             four
54     79  toyota      wagon       104.5   187.8        dohc              six

    horsepower  average-mileage    price
48          62               35   5348.0
49          62               31   6338.0
50          62               31   6488.0
51          62               31   6918.0
52          62               27   7898.0
53          62               27   8778.0
54         156               19  15750.0

8. Total number of cars per company:
 company
toyota           7
bmw              6
mazda            5
nissan           5
audi             4
mercedes-benz    4
mitsubishi       4
volkswagen       4
alfa-romero      3
chevrolet        3
honda            3
jaguar           3
dodge            2
porsche          2
volvo            2
isuzu            1
Name: count, dtype: int64

9. Most expensive car from each company:
 company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu             6785.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

10. Average mileage for each company:
 company
alfa-romero      20.333333
audi             20.000000
bmw              19.000000
chevrolet        41.000000
dodge            31.000000
honda            26.333333
isuzu            24.000000
jaguar           14.333333
mazda            28.000000
mercedes-benz    18.000000
mitsubishi       29.500000
nissan           31.400000
porsche          17.000000
toyota           28.714286
volkswagen       31.750000
volvo            23.000000
Name: average-mileage, dtype: float64

11. Cars sorted by ascending price:
           company    price
13      chevrolet   5151.0
27          mazda   5195.0
48         toyota   5348.0
36     mitsubishi   5389.0
28          mazda   6095.0
37     mitsubishi   6189.0
17          dodge   6229.0
14      chevrolet   6295.0
49         toyota   6338.0
16          dodge   6377.0
50         toyota   6488.0
15      chevrolet   6575.0
41         nissan   6649.0
21          isuzu   6785.0
29          mazda   6795.0
42         nissan   6849.0
51         toyota   6918.0
38     mitsubishi   6989.0
40         nissan   7099.0
18          honda   7295.0
43         nissan   7349.0
55     volkswagen   7775.0
52         toyota   7898.0
56     volkswagen   7975.0
57     volkswagen   7995.0
39     mitsubishi   8189.0
53         toyota   8778.0
58     volkswagen   9995.0
20          honda  10345.0
30          mazda  11845.0
59          volvo  12940.0
19          honda  12945.0
60          volvo  13415.0
0     alfa-romero  13495.0
44         nissan  13499.0
3            audi  13950.0
5            audi  15250.0
54         toyota  15750.0
7             bmw  16430.0
1     alfa-romero  16500.0
2     alfa-romero  16500.0
8             bmw  16925.0
4            audi  17450.0
31          mazda  18344.0
6            audi  18920.0
9             bmw  20970.0
32  mercedes-benz  25552.0
33  mercedes-benz  28248.0
10            bmw  30760.0
24         jaguar  32250.0
45        porsche  34028.0
25         jaguar  35550.0
26         jaguar  36000.0
12            bmw  36880.0
46        porsche  37028.0
34  mercedes-benz  40960.0
11            bmw  41315.0
35  mercedes-benz  45400.0

In [12]:
# ---------------------------------------------------------------
# Part 3: Combining DataFrames
# ---------------------------------------------------------------

print("\n================ Part 3: Combining DataFrames ================\n")

# 12. Create two DataFrames and concatenate them
GermanCars = {
    'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'],
    'Price': [23845, 171995, 135925, 71400]
}
japaneseCars = {
    'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi'],
    'Price': [29995, 23600, 61500, 58900]
}

df1 = pd.DataFrame(GermanCars)
df2 = pd.DataFrame(japaneseCars)
concatenated_df = pd.concat([df1, df2], ignore_index=True)

print("12. Concatenated DataFrame (German + Japanese cars):\n", concatenated_df)

# 13. Merge two DataFrames on 'Company' column
Car_Price = {
    'Company': ['Toyota', 'Honda', 'BMV', 'Audi'],
    'Price': [23845, 17995, 135925, 71400]
}
Car_Horsepower = {
    'Company': ['Toyota', 'Honda', 'BMV', 'Audi'],
    'horsepower': [141, 80, 182, 160]
}

price_df = pd.DataFrame(Car_Price)
hp_df = pd.DataFrame(Car_Horsepower)

merged_df = pd.merge(price_df, hp_df, on='Company')
print("\n13. Merged DataFrame (Price + Horsepower):\n", merged_df)

================ Part 3: Combining DataFrames ================

12. Concatenated DataFrame (German + Japanese cars):
       Company   Price
0        Ford   23845
1    Mercedes  171995
2         BMV  135925
3        Audi   71400
4      Toyota   29995
5       Honda   23600
6      Nissan   61500
7  Mitsubishi   58900

13. Merged DataFrame (Price + Horsepower):
   Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160